[
  {
    "title": "Global Operations Manager Fashion",
    "company": "Rosie Etienne",
    "location": "",
    "description": "<p class=\"p1\"><strong>About Us</strong><br />We are an international bridal fashion brand, creating made-to-order gowns and selected stock pieces. With warehouses in the UK and US, factories in worldwide and multiple Shopify expansion stores serving customers worldwide, we’re growing rapidly and need an experienced Operations Manager to build structure and efficiency into our operations.</p><p class=\"p2\"><br /></p><p class=\"p1\"><strong>The Role</strong><br />You will be responsible for implementing and managing systems to streamline our global operations — from order intake through production, inventory, warehousing, and delivery. You will work closely with our production teams, warehouses, and sales channels to ensure orders are fulfilled on time, stock is accurate, and our processes scale smoothly.</p><p class=\"p2\"><br /></p><p class=\"p1\"><strong>Key Responsibilities</strong></p><ul class=\"ul1\"><li class=\"li1\"><strong>Systems Implementation</strong><ul class=\"ul1\"><li class=\"li1\">Select and implement inventory/ERP systems tailored for fashion (e.g., Zedonk, Uphance, Unleashed, or similar).</li><li class=\"li1\">Integrate systems with Shopify stores to maintain accurate, real-time stock visibility.</li></ul></li><li class=\"li1\"><strong>Inventory &amp; Warehousing</strong><ul class=\"ul1\"><li class=\"li1\">Oversee stock planning and control across UK and US warehouses.</li><li class=\"li1\">Track raw materials and finished goods, ensuring replenishment and allocation for orders.</li><li class=\"li1\">Establish processes for warehouse reporting, cycle counts, and dispatch tracking.</li></ul></li><li class=\"li1\"><strong>Production Management</strong><ul class=\"ul1\"><li class=\"li1\">Manage order flow from Shopify → factories<span class=\"Apple-converted-space\">  </span>→ warehouses → customers.</li><li class=\"li1\">Ensure timelines are met for made-to-order and stock orders.</li><li class=\"li1\">Track production progress and flag risks or delays early.</li></ul></li><li class=\"li1\"><strong>Logistics &amp; Fulfilment</strong><ul class=\"ul1\"><li class=\"li1\">Coordinate with shipping partners to ensure efficient global delivery.</li><li class=\"li1\">Standardise and optimise fulfilment processes for both stock and custom orders.</li></ul></li><li class=\"li1\"><strong>Reporting &amp; Planning</strong><ul class=\"ul1\"><li class=\"li1\">Create dashboards and reports on stock levels, production status, order fulfilment, and delivery timelines.</li><li class=\"li1\">Work with leadership to forecast demand and plan production capacity.</li></ul></li></ul><p class=\"p3\"><br /></p><p class=\"p1\"><strong>Requirements</strong></p><ul class=\"ul1\"><li class=\"li1\">Proven experience in <strong>fashion operations management</strong> (bridal, luxury, or apparel preferred).</li><li class=\"li1\">Strong background in <strong>implementing inventory or ERP systems</strong> (fashion ERP a major plus).</li><li class=\"li1\">Hands-on understanding of production cycles (made-to-order and stock).</li><li class=\"li1\">Experience coordinating across multiple countries, factories, and warehouses.</li><li class=\"li1\">Excellent communication and organisational skills.</li><li class=\"li1\">Strong analytical mindset with proficiency in tools like Excel/Google Sheets; comfort with Shopify integrations.</li><li class=\"li1\">Ability to work independently and manage global teams remotely.</li></ul><p class=\"p3\"><br /></p><p class=\"p1\"><strong>Nice to Have</strong></p><ul class=\"ul1\"><li class=\"li1\">Experience scaling an international fashion brand.</li><li class=\"li1\">Familiarity with Shopify expansion stores and multi-currency / multi-region setups.</li><li class=\"li1\">Prior experience in bridal fashion.</li></ul><p class=\"p3\"><br /></p><p class=\"p1\"><strong>What We Offer</strong></p><ul class=\"ul1\"><li class=\"li1\">Fully remote role (global applicants welcome).</li><li class=\"li1\">Salary <strong>dependent on experience</strong>.</li><li class=\"li1\">Opportunity to shape operations from the ground up in a fast-growing brand.</li><li class=\"li1\">Work closely with a creative and ambitious team building a global bridal label.</li></ul><br/><br/>Please mention the word **REAFFIRMATION** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-global-operations-manager-fashion-rosie-etienne-1113309"
  },
  {
    "title": "Senior Full stack Developer",
    "company": "Lemon.io",
    "location": "",
    "description": "<p>Are you a talented Senior Developer looking for a remote job that lets you show your skills and get decent compensation? Look no further than <a href=\"https://lemon.io/for-developers/?utm_source=remoteok&amp;utm_medium=job_ad&amp;utm_campaign=supply_en_fullstack_react/node/python_sep_2025_job_ad\">Lemon.io</a> — the marketplace that connects you with hand-picked companies in the US and Europe.</p><p><strong>What we offer:</strong></p><ul><li>The rate depends on your seniority level, skills and experience. We've already paid out over $11M to our engineers.</li><li>No more hunting for clients or negotiating rates — let us handle the business side of things so you can focus on what you do best.</li><li>We'll manually find the best project for you according to your skills and preferences.</li><li>Choose a schedule that works best for you. It’s possible to communicate async or minimally overlap within team working hours.</li><li>We respect your seniority so you can expect no micromanagement or screen trackers.</li><li>Communicate directly with the clients. Most of them have technical backgrounds. Sounds good, yeah?</li><li>We will support you from the time you submit the application throughout all cooperation stages.</li><li>Most of our projects involve working in a fast-paced startup environment. We hope you like it as much as we do.</li><li>Through our community, we will connect you with the best developers from more than 50 countries.</li></ul><h2><strong>We have several Senior React Full-Stack positions available. Here are the general requirements for these roles.</strong></h2><h3><strong>Senior React &amp; Python Position</strong></h3><ul><li>4+ years of software development experience.</li><li>3+ years of commercial experience with React.js and Python.</li><li>Experience with AWS, GCP, or Azure is required.</li><li>Experience with Next.js, Node.js, Django, TypeScript, or AI is a strong plus.</li></ul><hr /><h3><strong>Senior Node &amp; React Position</strong></h3><ul><li>5+ years of software development experience.</li><li>5+ years of commercial experience with React.js and Node.js.</li><li>Experience with Next.js, TypeScript, AWS, and Supabase is required.</li></ul><p><strong>Other requirements:</strong></p><ul><li>Strong technical skills: as a Senior Developer, you are expected to be able to create projects from scratch and have a deep understanding of application architecture.</li><li>Clear and effective communication in English — advanced ability to discuss business tasks, justify decisions, and communicate issues. Good self-presentation is also essential for upcoming client calls.</li><li>Strong self-organizational skills — ability to work full-time remotely with no supervision.</li><li>Reliability — we want to trust you and expect that you won’t let us and the client down.</li><li>Adaptability and Flexibility — the ability to onboard the project promptly after accepting it and start delivering results quickly.</li></ul><p>Sounds good for you? Apply now and join the <a href=\"https://lemon.io/for-developers/?utm_source=remoteok&amp;utm_medium=job_ad&amp;utm_campaign=supply_en_fullstack_react/node/python_sep_2025_job_ad\">Lemon.io</a> community!</p><h2><strong>NOT YOUR TECH STACK?</strong></h2><p>We have multiple projects available for Senior Developers. If you have 4+ years of commercial software development experience and are proficient in any of the following areas — AI Engineering, Data Engineering, React Native &amp; Node, Blockchain, MLOps — we’d be happy to connect and match you with a suitable project.</p><p><strong>If your experience matches our requirements, be ready for the next steps:</strong></p><ul><li>VideoAsk — watch a short video about our startup, up to 10 minutes</li><li>Complete your profile on our website</li><li>30-minute screening call</li><li>Technical interview</li><li>Feedback</li><li>Magic Box (we are looking for the best project for you).</li></ul><p>We do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.</p><p>P.S. <span class=\"notion-enable-hover\">We work with developers from 50+ countries in different regions:</span> Europe, LATAM, the U.S (if you are an owner of W-9 ben form), Canada, Asia (Japan, Singapore, South Korea, Philippines, Indonesia), Oceania (Australia, New Zealand, Papua New Guinea), and the the UK. However, we have some exceptions.</p><p><strong>At the moment, we don’t have a legal basis to accept applicants from the following countries:</strong></p><ul><li>European: Iceland, Liechtenstein, Kosovo, Belarus, Russia, and Serbia.</li><li>Latin America: Cuba and Nicaragua</li><li>Most Asian countries and Africa.</li></ul><p>We expand and shorten the list of exemptions regularly.</p><p><br /></p><p>We do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.</p><p>Do you represent a company with engineers who match the description and want to collaborate with us through staff augmentation? Then register <a href=\"https://lemon.io/for-developers/?utm_source=remoteok&amp;utm_medium=job_ad&amp;utm_campaign=supply_en_fullstack_react/node/python_sep_2025_job_ad\">here</a>.</p><p><br /></p><br/><br/>Please mention the word **RICHER** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-full-stack-developer-lemon-io-1112254"
  },
  {
    "title": "LLM Data Engineer",
    "company": "Sanctuary Computer",
    "location": "",
    "description": "<p><strong>Original job post link:</strong></p><p><a href=\"https://garden3d.notion.site/Machine-Learning-LLM-Data-Engineer-26b131fea2c780219ae8deef5fa2aec0\">LLM Data Engineer Original Job Post Link</a></p><p>🌎 <strong>About garden3d</strong></p><p>We are a worker-owned creative collective, innovating on everything from brands and IRL communities to IoT devices and cross-platform apps. We share profit, open source everything, spin out new businesses, and invest in exciting ideas through financial and/or in-kind contributions.</p><p>Our client roster includes Google, Stripe, Figma, Hinge, Black Socialists in America, ACLU, Pratt, Parsons, Mozilla, The Nobel Prize, MIT, Gnosis, Etsy &amp; Gagosian. We’re the software team behind innovative products like The Light Phone &amp; Mill, and we a global, decentralized community space collective called Index Space.</p><p>We think of our garden3d as collective for creative people, prioritizing a happy, talented, and diverse studio culture. We work on projects that bring value to our world, and we balance deep care for the work we do with a genuine curiosity about life outside of our jobs.</p><h2>🔮 <strong>Who we’re looking for:</strong></h2><p>Right now, we’re looking for a <span class=\"notion-enable-hover\"><strong>Data Engineer</strong> with expertise in data pipelines, workflow orchestration, and data integration.</span> Our current approach to data ingestion relies on an in-house application that defines lightweight workflows in code and executes them with queues. We’re now expanding this process by adopting <strong><span class=\"notion-enable-hover\">Prefect</span></strong> as an orchestration tool, enabling us to manage pipelines for structured and unstructured data from diverse sources, including web crawls and scrapers.</p><p>In this role, you’ll work on a variety of client projects to find cost-effective, high-quality, pragmatic solutions to complex problems. Responsibilities will include:</p><ul><li>Monitoring and maintaining data pipelines, troubleshooting new errors, and addressing format drift</li><li>Extracting and enriching additional data elements from diverse sources</li><li>Reprocessing and validating large datasets in batch workflows</li><li>Designing and integrating new data sources into existing pipelines</li><li>Aligning and integrating extracted data with the core application data model to ensure consistency and usability</li><li>Participating in code reviews, providing constructive feedback to teammates and ensuring adherence to best practices</li><li>Contributing to project success by keeping a close eye on team velocity, project scope, budget, and timeline</li><li>Negotiating with clients to align project scope with budget and timeline, if needed</li></ul><p><br /></p><p>The person we’re looking for is happy, relaxed and easy to get along with. They’re flexible on anything except conceits that will lower their usually outstanding work quality. They work “smart”, by carefully managing their workflow and staggering features that have dependencies intelligently, they prefer deep work but are OK coming up to the surface now and then for top-level/strategic conversations.</p><p>We believe people with backgrounds or interests in design, art, music, food or fashion tend to have a well-rounded sense of design &amp; quality — so a variety of hobbies or side projects is a big nice to have!</p><h2>💸 Compensation</h2><p>Our pay scale ranges from <code>$85 p/hr</code> to <code>$130 p/hr</code> pending seniority (&amp; team leadership experience), and our projects are rarely less than 8 full-time weeks at 40 hours per week. Additionally, we pay discretionary bonuses for going over and above — like training &amp; coaching others, winning new business, speaking at conferences, etc.</p><p>We prefer long-standing relationships with highly accountable and communicative team members, so we encourage candidates to expect longer-term engagements. A Data Engineer working 40 — 45 full-time weeks may take home <strong>$150k — $200k USD.</strong></p><p>🔑 <strong>Must Have Competencies:</strong></p><ul><li>Strong proficiency in <strong>Python</strong></li><li>Experience with <strong>data/workflow orchestration tools</strong> (e.g., Prefect, Dagster, Airflow)</li><li>A thorough understanding ETL &amp; data transformation for the ingestion of industry standard LLMs (OpenAI, Claude, etc)</li><li>Familiarity with <strong>Large Language Models (LLMs)</strong></li><li>Skilled in <strong>interfacing with APIs</strong> (OpenAI, Google Gemini/Vertex, etc.) using wrapper libraries such as Instructor, LiteLLM, etc.</li><li>Practical experience in <strong>prompt engineering</strong></li><li>Ability to work with <strong>structured outputs</strong> and potentially tool calling</li><li><strong>5+ years</strong> of general experience in backend (Ruby on Rails, Elixir Phoenix, Python Django, or Node Express) and/or native app development (React Native, Flutter, Android, AOSP, Kotlin/Java).<br /></li></ul><p>💪 <strong>Nice to Have Competencies:</strong></p><p>We’re always pitching for new and exciting technology niches. Some of the areas below are relevant to us!</p><ul><li>Experience with <strong>Google Cloud Platform (GCP)</strong>, particularly Cloud Run and Cloud Tasks</li><li>Knowledge of <strong>search technologies</strong>, including embeddings and vector databases for semantic search, as well as keyword-based search (BM25)</li><li>Familiarity with <strong>PySpark</strong> for batch data processing</li><li><strong>Experience working with LLMs, Vector Databases, and other generalist AI-enabled application patterns</strong></li><li><strong>Client-facing experience</strong>: working directly with customers to gather requirements and provide technical solutions</li><li><strong>Product management experience</strong>: defining product roadmaps and collaborating closely with stakeholders</li><li><strong>Engineering management experience</strong>: leading teams, setting technical direction, and mentoring developers<br /></li></ul><h2>🎤 <strong>How we interview:</strong></h2><p>Our interview process starts with a call where you get to meet a few members of our team. From there we’ll ask appropriate candidates to take part in a technical exercise which helps illustrate skill level and comfort.</p><p>→ It’s also a great way to see what it’s like to work with us and help support folks who may not have the ‘right title’ but have the experience and technical know-how for the role.</p><h2>👩‍🏭 <strong>How we work:</strong></h2><p>We believe that there’s a better balance between the poles of freelancing &amp; full time, and for that reason Sanctuary works differently to most shops:</p><ul><li><a href=\"https://sanctucompu.substack.com/p/our-open-source-2020-profit-and-loss\"><strong>Transparency &amp; Ownership:</strong></a> We release out Profit &amp; Loss statements to the community each year, open source our best ideas, and talk business &amp; money with everyone in the company. We’re proud to run our business with integrity, and for that reason we share everything with our team &amp; community.</li><li><a href=\"https://negative.sanctuary.computer/\">150% Carbon Negative:</a> Our studio offsets 150% of the carbon we use to do business each year, dated back to our founding in 2015. We turn down work that is not in line with our morals, and we encourage our peers to do the same. <a href=\"https://twitter.com/sanctucompu/status/1385282161197060100\">We were certified climate neutral earlier this year</a>.</li><li><a href=\"https://sanctucompu.substack.com/p/our-moral-compass\">Strong Morals:</a> Since our founding, we've turned down somewhere between $1mm - $2mm of work that didn't meet our moral standards. (Most of that was DTC brands that can't show a valid sustainability initiative).</li><li><strong>Async &amp; Decentralized:</strong> We use tools optimized for calm, thoughtful communication, and opt for async whenever possible. We fight hard to maintain our focus time.</li><li><strong>Remote Friendly:</strong> Our company is fluent in remote work, making our workplace more decentralized, and democratized in the process.</li><li><strong>Ideas &amp; Products:</strong> In our spare studio time, we work to build our own open source or internal products to diversify &amp; bolster our income. We create amazing technology products for our clients, so why not for the studio?</li></ul><p><strong>→ Read more on our <a href=\"https://sanctucompu.substack.com/\">Substack, over here</a>, or our <a href=\"https://medium.com/sanctuary-computer-inc\">Medium, over there</a>.</strong></p><p>Quick tip! Adding a <strong>Loom recording</strong> to your profile in our form to showcase your skillset can really make your application stand out!</p><p><strong>Please click this Important link below or copy the URL (Same as the apply button) to proceed with your application by telling us a bit more about your interest in the role:<br /></strong></p><p><a href=\"https://www.notion.so/garden3d/1f1131fea2c78095922ec7e09bd96101\">garden3d Creative Form</a></p><p><br /></p><br/><br/>Please mention the word **ENDORSES** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-llm-data-engineer-sanctuary-computer-1112042"
  },
  {
    "title": "Client Success Manager",
    "company": "Venus",
    "location": "",
    "description": "<p dir=\"ltr\">We’re looking for a female Client Success Manager to join our team. You will be the primary point of contact for our creators, ensuring they feel supported, guided, and motivated. From onboarding to long-term growth, you’ll play a key role in building and maintaining strong relationships with them.</p><p dir=\"ltr\">This role reports directly to the CEO and the Operations Manager.</p><p dir=\"ltr\"><strong>Key Responsibilities</strong></p><ul><li dir=\"ltr\"><p dir=\"ltr\">Lead onboarding for new creators, ensuring smooth setup and integration into our systems.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Build and maintain strong client relationships through regular check-ins and communication.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Act as a liaison between creators and internal teams (creative, management, strategy, etc.).<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Host weekly/bi-weekly meetings with creators to discuss performance, content direction, and updates.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Identify challenges or concerns early and provide proactive solutions.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Track creator satisfaction and performance metrics, escalating issues when needed.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Support the Operations Manager in refining client management systems, processes, and project management.<br /><br /></p></li></ul><p dir=\"ltr\"><strong>Requirements</strong></p><ul><li dir=\"ltr\"><p dir=\"ltr\">Previous experience in account management, client success, or talent management (experience in the digital content industry is a plus).<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Strong communication and interpersonal skills.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Organized and detail-oriented with the ability to manage multiple clients at once.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Comfortable hosting virtual meetings and presenting performance feedback.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Proactive problem solver who thrives in a fast-paced, startup-style environment.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Ability to work discreetly and professionally.<br /><br /></p></li></ul><p dir=\"ltr\"><strong>What We Offer</strong></p><ul><li dir=\"ltr\"><p dir=\"ltr\">Competitive pay: $2500 – $3500 per month<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Flexible, remote-friendly work environment<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Opportunity to work with a dynamic, ambitious team in a growing industry<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">A role where you directly impact the success of creators</p></li></ul><p><br /></p><br/><br/>Please mention the word **TINGLE** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-client-success-manager-venus-1109273"
  },
  {
    "title": "Senior Ruby on Rails Engineer",
    "company": "EverAI",
    "location": "",
    "description": "<div class=\"_descriptionText_14ib5_206\"><div class=\"_descriptionText_oj0x8_198\"><h1>Our Vision &amp; Products</h1><p><em><strong>🚀 EverAI — Building the Future of AI Companionship</strong></em></p><p><em>One of the Top 15 Largest &amp; Fastest-Growing AI Companies in the World</em></p><p><em>30+ Million Users in under 2 years — Help Us Reach 100M first, 500M next</em></p><p><br /></p><p>At <strong>EverAI</strong>, we’re shaping what it means to connect with AI. With <strong>30+ million users and counting</strong>, we're not just building products — we're creating entirely new categories.</p><p>Our flagship product is the <strong>world’s largest AI girlfriend/boyfriend platform</strong>, redefining relationships for millions. It is governed by our proprietary moderation system, EverGuard — an internal AI designed to ensure everything we build is <strong>safe, ethical, and human-first</strong>.</p><p><em>And we’re only just getting started!</em></p><p><br /></p><h1>Our Team</h1><p>We are an enthusiastic, passionate and hardworking team of 70 people. Our founding team has strong entrepreneurial experience building and scaling web products from 0 to IPO.</p><p><br /></p><p><strong>Alexis Soulopoulos </strong>[CEO]</p><p><em>• 10+ years in Tech Executive Leadership</em></p><p><em>• Co-Founder Mad Paws Holdings (from 0 to IPO)</em></p><p><em>• Forbes 30 under 30 + Deloitte TechFast50 ’22 &amp; ‘23</em></p><p><br /></p><p><strong>Michael Monin</strong> [Co-founder &amp; CTO]</p><p><em>• 10+ years as CTO / COO (web2/web3), 1+ year in AI/LLM</em></p><p><em>• Serial-entrepreneur: MTK Digital (exited / 0-&gt;$20m revenue) and Zipchat (AI Chatbot for E-commerce brands)</em></p><p><br /></p><p><strong>Thomas Lacroix </strong>[Co-founder &amp; CMO]</p><p><em>• 8+ years in Customer Acquisition &amp; E-commerce Growth</em></p><p><em>• Serial-entrepreneur: Curatible (sold to Blackstone) and MTK Digital (exited / 0-&gt;$20m revenue)</em></p><p><br /></p><p><strong>Maruša Fasano </strong>[CFO/Legal]</p><p><em>• 25+ years in Finance, Strategy, M&amp;A</em></p><p><em>• Ex-CFO/M&amp;A @Curatible (exited to Blackstone)</em></p><p><em>• Ex-President of the Board @SotremoSA (exited)</em></p><p><em>• Co-founder/CFO @SoftOne (exited)</em></p><p><br /></p><h1>Your Role</h1><p>Our tech team is expanding rapidly to keep pace with the ambitious feature roadmap we've set out. We are therefore hiring experienced <strong>Senior</strong> <strong>Software Engineers (Back-end / Ruby)</strong> to help us build and scale our product. You’ll have the opportunity to help define our roadmap and find the best technical solutions to help our customers. You will also have time to run some experiments and bring new ideas to the table.</p><p>Reporting directly to our Tech Lead, you will be responsible for:</p><ul><li><p><em>Interacting with the Product Manager to review project specs</em></p></li><li><p><em>Preparing integration plans, break-downs, and estimations</em></p></li><li><p><em>Hands-on code implementation, PRs, code reviews, testing, etc.</em></p></li></ul><p>You'll be working with Michael (co-founder and CTO) along with the product team and the engineering team (web developers, SRE, data scientists).</p><p>💎 NB: while we remain open to full-stack expertise, we are looking for people with a strong edge on <strong>back-end development using Ruby-on-Rails.</strong></p><p><br /></p><h1>Your Qualifications</h1><p><br /></p><h2>Must-haves</h2><p>💼 5+ years of experience:</p><ul><li><p><em>As a back-end or full-stack software engineer - recent experience with Ruby-on-Rails is mandatory</em></p></li><li><p><em>In tech scale-ups or any similarly agile and fast-paced environment</em></p></li><li><p><em>On large-scale products where your code was used by thousands of monthly users</em></p></li></ul><p>🗣 Strong communication &amp; collaborative skills (perfectly fluent in English)</p><p>🧢 Ownership and commitment - we’re looking for owners, not renters</p><p>⚡️ Doer mindset - we are moving fast and we need people who can find the right balance between software craftsmanship and velocity</p><p><strong>🫶🏻</strong> User-centricity - you are proud of what you build and you share our obsession for amazing user experience</p><p>🍭 #NSFW - you are comfortable building products that are based on uncensored models and content</p><p><br /></p><h3>Bonus points</h3><ul><li><p>Past experience and/or interest in data science and generative AI (NLP, ML, MLOps…)</p></li><li><p>Experience working with globally distributed teams</p></li></ul><p><br /></p><h1>Why EverAI?</h1><p>📈 <strong>Exponential Growth</strong>: From 30M+ users in 18 months, to 100M next — and 500M beyond</p><p>🚀 <strong>Track Record of Category-Creating Innovation</strong>: We consistently launch <strong>world-first AI applications</strong> — setting the pace, not following it</p><p>🌍 <strong>Global Impact</strong>: Top-tier user growth, real-world adoption, and cultural relevance</p><p>🧠 <strong>Proven Leadership</strong>: A senior team that’s <strong>launched, scaled, and exited &amp; IPO’d multiple scale ups</strong> — now fully focused on reshaping AI companionship</p><p>👥 <strong>Elite Remote Team</strong>: 100% remote and built to win — world-class talent from <strong>Tier 1 tech companies</strong>, with a culture of ownership, velocity, and radical creativity</p><p>🛡️ <strong>Ethical Core</strong>: Our AI ecosystem is governed by <strong>EverGuard, our proprietary AI moderation technology</strong>, ensuring responsible development at scale</p><p><br /></p><h1>What We Offer</h1><p>✍️ We prefer a B2B contract but we can be flexible, as long as you’re in it for the long haul</p><p>📍 Full-remote (you work from the place that suits you best)</p><p>🏝️ 4 weeks PTO</p><p>👨‍👩‍👧‍👦 Annual gathering to get to know each other better</p><p>❤️‍🩹 Health &amp; Wellness support: Up to $200 for your wellbeing expenses + Access to unlimited 1:1 sessions with psychologists and lifestyle experts through <em>OpenUp</em> (also available to up to three of your family members)</p><p>📚 Learning budget</p><p>💻 Company laptop</p><p>⚡️ GPT-4, Mistral and Hugging Face Pro plan</p></div></div><br/><br/>Please mention the word **SUFFICIENT** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-ruby-on-rails-engineer-everai-1107448"
  },
  {
    "title": "Senior Performance Marketer",
    "company": "EverAI",
    "location": "",
    "description": "<h1>Our Vision &amp; Products</h1><p><em><strong>🚀 EverAI — Building the Future of AI Companionship</strong></em></p><p><em>One of the Top 15 Largest &amp; Fastest-Growing AI Companies in the World</em></p><p><em>30+ Million Users in under 2 years — Help Us Reach 100M first, 500M next</em></p><p><br /></p><p>At <strong>EverAI</strong>, we’re shaping what it means to connect with AI. With <strong>30+ million users and counting</strong>, we're not just building products — we're creating entirely new categories.</p><p>Our flagship product is the <strong>world’s largest AI girlfriend/boyfriend platform</strong>, redefining relationships for millions. It is governed by our proprietary moderation system, EverGuard — an internal AI designed to ensure everything we build is <strong>safe, ethical, and human-first</strong>.</p><p><em>And we’re only just getting started!</em></p><h1>Our Team</h1><p>We are an enthusiastic, passionate and hardworking team of 70 people. Our founding team has strong entrepreneurial experience building and scaling web products from 0 to IPO.</p><p><br /></p><p><strong>Alexis Soulopoulos </strong>[CEO]</p><p><em>• 10+ years in Tech Executive Leadership</em></p><p><em>• Co-Founder Mad Paws Holdings (from 0 to IPO)</em></p><p><em>• Forbes 30 under 30 + Deloitte TechFast50 ’22 &amp; ‘23</em></p><p><br /></p><p><strong>Michael Monin</strong> [Co-founder &amp; CTO]</p><p><em>• 10+ years as CTO / COO (web2/web3), 1+ year in AI/LLM</em></p><p><em>• Serial-entrepreneur: MTK Digital (exited / 0-&gt;$20m revenue) and Zipchat (AI Chatbot for E-commerce brands)</em></p><p><br /></p><p><strong>Thomas Lacroix </strong>[Co-founder &amp; CMO]</p><p><em>• 8+ years in Customer Acquisition &amp; E-commerce Growth</em></p><p><em>• Serial-entrepreneur: Curatible (sold to Blackstone) and MTK Digital (exited / 0-&gt;$20m revenue)</em></p><p><br /></p><p><strong>Maruša Fasano </strong>[CFO/Legal]</p><p><em>• 25+ years in Finance, Strategy, M&amp;A</em></p><p><em>• Ex-CFO/M&amp;A @Curatible (exited to Blackstone)</em></p><p><em>• Ex-President of the Board @SotremoSA (exited)</em></p><p><em>• Co-founder/CFO @SoftOne (exited)</em></p><p><br /></p><h1>Your Role</h1><p>This is a<strong> hands-on role</strong> for someone who can execute fast, iterate with creative and funnel inputs, and scale what works. You’ll inherit high-performing campaigns and work directly with our CMO to double down on growth.</p><p>You’ll then also have the opportunity to test and scale new channels (TikTok, Meta, Snapchat, Native, ASA) depending on performance and market constraints.</p><p><br /></p><h2>Your Responsibilities</h2><h3><strong>Campaign Ownership and Scaling</strong></h3><ul><li><p>Take the lead on one or two paid acquisition channels across direct-buy and programmatic networks (e.g., ExoClick, TrafficStars, TrafficJunky), with potential to expand scope based on performance</p></li><li><p>Contribute to building scalable acquisition funnels — from execution to iteration — with aggressive growth targets in mind</p></li><li><p>Run high-velocity testing loops (creatives, audiences, placements) to improve CAC and LTV</p></li></ul><h3><strong>Performance Analysis and Strategy</strong></h3><ul><li><p>Monitor performance daily using tools like Voluum, GA4, and internal dashboards</p></li><li><p>Drive decision-making through deep analysis of CPA, ROAS, retention, and cohort behavior</p></li><li><p>Build and maintain internal reporting frameworks that guide strategic shifts and tactical moves</p></li></ul><h3><strong>Creative &amp; Funnel Optimization</strong></h3><ul><li><p>Own the creative briefing process: define hooks, formats, and angles based on performance patterns</p></li><li><p>Collaborate closely with the content and product teams to launch and iterate on high-converting landing pages</p></li><li><p>Implement systems to reduce creative fatigue and increase speed of testing</p></li></ul><h3><strong>Partnership Management &amp; Media Strategy</strong></h3><ul><li><p>Build strong relationships with traffic sources and negotiate premium placements and custom deals</p></li><li><p>Explore new acquisition opportunities (networks, formats, tools) and build internal evaluation criteria</p></li><li><p>Stay ahead of ecosystem changes (platform rules, algorithm shifts) and adapt strategy accordingly</p></li></ul><h3><strong>Automation &amp; Scaling Systems</strong></h3><ul><li><p>Identify opportunities to streamline acquisition processes through automation and internal tools</p></li><li><p>Create SOPs, playbooks, and experiment pipelines for scaling campaigns efficiently</p><p><br /></p></li></ul><h2>Challenges You’ll Tackle</h2><ul><li><p>Scale existing campaigns to 3x+ budget while maintaining CAC/ROAS goals</p></li><li><p>Contribute to growing the user base from 30M to 100M users in the next 12 months</p></li><li><p>Execute 0-to-1 testing in new channels</p></li><li><p>Improve conversion through landing page testing and funnel iteration</p></li><li><p>Own both creative input and analytical feedback loops</p></li></ul><p><br /></p><h1>Your Qualifications</h1><p><br /></p><h2>Hard Skills</h2><h3>Must-Haves</h3><ul><li><p>4–10+ years in performance marketing or user acquisition</p></li><li><p>Proven track record managing $500K to $1M+/month in paid media spend</p></li><li><p>Full ownership of campaign execution, results, and optimization</p></li><li><p>Experience with Meta, TikTok, Snapchat, ASA, or native platforms</p></li><li><p>Analytical fluency: GA4, Voluum, tracking setups, dashboards</p></li><li><p>Strong creative instincts: can write briefs, analyze hooks, and iterate fast</p></li><li><p>Experience optimizing landing pages and funnel conversion</p></li><li><p>Comfortable with NSFW content and running campaigns on adult networks</p></li></ul><p><br /></p><h3>Nice‑to‑Haves</h3><ul><li><p>Past exposure to subscription models and CAC/LTV frameworks</p></li><li><p>Familiarity with DSPs and programmatic environments</p></li><li><p>Experience in sensitive or regulated verticals (e.g. dating, femtech, telehealth)</p></li><li><p>Track record of scaling UA for mobile apps</p></li></ul><p><br /></p><h2>Soft Skills</h2><p>🗣 Strong communication &amp; collaborative skills (perfectly fluent in English)</p><p>🎯 Goal-oriented, ownership and commitment</p><p>⚡️ Doer mindset - we are moving fast and need people who can balance execution, planning, and strategy</p><p>⏱️ Obsessive about speed, performance and iteration</p><p>🧢 Humble - willing to learn, open to feedback</p><p>🍭 #NSFW - Comfortable building products based on uncensored models and content</p><p><br /></p><h1>Why EverAI?</h1><p>📈 <strong>Exponential Growth</strong>: From 30M+ users in 18 months, to 100M next — and 500M beyond</p><p>🚀 <strong>Track Record of Category-Creating Innovation</strong>: We consistently launch <strong>world-first AI applications</strong> — setting the pace, not following it</p><p>🌍 <strong>Global Impact</strong>: Top-tier user growth, real-world adoption, and cultural relevance</p><p>🧠 <strong>Proven Leadership</strong>: A senior team that’s <strong>launched, scaled, and exited &amp; IPO’d multiple scale ups</strong> — now fully focused on reshaping AI companionship</p><p>👥 <strong>Elite Remote Team</strong>: 100% remote and built to win — world-class talent from <strong>Tier 1 tech companies</strong>, with a culture of ownership, velocity, and radical creativity</p><p>🛡️ <strong>Ethical Core</strong>: Our AI ecosystem is governed by <strong>EverGuard, our proprietary AI moderation technology</strong>, ensuring responsible development at scale</p><p><br /></p><h1>What We Offer</h1><p>✍️ We prefer a B2B contract but we can be flexible, as long as you’re in it for the long haul</p><p>📍 Full-remote (you work from the place that suits you best)</p><p>🏝️ 4 weeks PTO</p><p>👨‍👩‍👧‍👦 Annual gathering to get to know each other better</p><p>❤️‍🩹 Health &amp; Wellness support: Up to $200 for your wellbeing expenses + Access to unlimited 1:1 sessions with psychologists and lifestyle experts through <em>OpenUp</em> (also available to up to three of your family members)</p><p>📚 Learning budget</p><p>💻 Company laptop</p><p>⚡️ GPT-4, Mistral and Hugging Face Pro plan</p><br/><br/>Please mention the word **GUMPTION** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-performance-marketer-everai-1107277"
  },
  {
    "title": "Senior Full Stack Engineer",
    "company": "Aguru UK",
    "location": "",
    "description": "<p dir=\"ltr\">Location: Remote (EU/UK preferred)<br />Team: Engineering<br />Type: Full-time, Contractor</p><h2 dir=\"ltr\">About the Role</h2><p dir=\"ltr\">Aguru is an agentic AI automation platform for SaaS businesses, bringing together agents, workflows, and communication tools into one unified system. As our first Senior Full Stack Engineer, you'll be an early key player in our small, high-impact team. You'll own critical parts of the product architecture, working across the stack to deliver scalable, performant, and user-friendly features. This is a unique opportunity to shape the future of our platform and bring complex automation capabilities to life by collaborating closely with product, design, and AI engineering.</p><h2 dir=\"ltr\">Responsibilities:</h2><ul><li dir=\"ltr\"><p dir=\"ltr\">Design, build, and maintain core application features in Next.js.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Develop robust APIs and server components.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Work on Supabase (PostgreSQL) data models, queries, and role-based access policies.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Implement responsive, accessible, and maintainable UIs with React, Tailwind CSS, and shadcn/ui.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Integrate with AI and automation frameworks (Mastra, Vercel AI SDK, OpenAI, Google Gemini, Playwright).<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Ensure reliability, security, and scalability of the platform.<br /><br /></p></li></ul><h2 dir=\"ltr\">Experience</h2><h2 dir=\"ltr\">Required:</h2><ul><li dir=\"ltr\"><p dir=\"ltr\">5+ years of professional experience in full-stack development.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Strong expertise in React and Next.js.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Proficiency in TypeScript.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Solid experience with SQL databases (PostgreSQL, Supabase) and ORMs.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Knowledge of API design and modern state management (TanStack Query or similar).<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Understanding of authentication/authorization flows.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Familiarity with automated testing and debugging complex workflows.</p></li></ul><h2 dir=\"ltr\">The following is a plus:</h2><ul><li dir=\"ltr\"><p dir=\"ltr\">Experience with AI/LLM integrations (OpenAI, Google Gemini, or similar).<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience with LLM prompt engineering.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Previous experience in SaaS platforms or workflow automation tools.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Contributions to open-source projects or developer communities.</p></li></ul><h2 dir=\"ltr\"><br />Core Competencies</h2><ul><li dir=\"ltr\"><p dir=\"ltr\"><strong>Analytical Skills &amp; Research: </strong>The ability to gather and analyse data, identify patterns, and draw logical, evidence-based conclusions.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Autonomy &amp; Accountability: </strong>The discipline to take ownership of your work, manage tasks independently, and deliver results with minimal supervision.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Tech Agility: </strong>The ability to quickly learn and adapt to new technologies, tools, and platforms.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Critical Thinking &amp; Problem-Solving:</strong> The ability to analyse complex challenges, identify root causes, and develop effective, logical solutions.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Creativity: </strong>The capacity to think innovatively, generate new ideas, and approach problems from unique perspectives.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Attention to Detail:</strong> A precise and thorough approach to your work, ensuring accuracy and quality in every task.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Communication &amp; Collaboration: </strong>The ability to clearly articulate ideas and work effectively with others to achieve shared goals.</p></li></ul><p dir=\"ltr\">Joining our team means that you'll be part of a small group of people who are genuinely excited about the product and momentum we're building. We value curiosity, collaboration and accountability. </p><p dir=\"ltr\">Here, you’ll get to see your work progress from an idea to a finished product, fast.</p><p dir=\"ltr\">This is a unique opportunity to make a real impact and grow alongside us. If this sounds like the kind of place you want to be, we'd love to hear from you.</p><p dir=\"ltr\">To apply, please send your CV for the attention of Oleg at <strong>hiring@aguru.com</strong> with the subject line <strong>\"Application for Senior Full Stack Engineer\"</strong>. The deadline to apply is September 30, 2025.</p><p dir=\"ltr\">Aguru is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all.</p><p><br /></p><br/><br/>Please mention the word **FORTUNE** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-full-stack-engineer-aguru-uk-1104983"
  },
  {
    "title": "Senior DevOps Engineer",
    "company": "Aguru UK",
    "location": "",
    "description": "<p dir=\"ltr\">Location: Remote (EU/UK preferred)</p><p dir=\"ltr\">Team: Engineering</p><p dir=\"ltr\">Type: Full-time,  Contractor.</p><p dir=\"ltr\">Aguru is an Agentic AI Automation Platform for SaaS. We’re looking for a Senior DevOps Engineer to own reliability, infrastructure, and deployment at scale. </p><p dir=\"ltr\">At Aguru, we’re building an AI-first workflow automation platform that integrates agents, workflows, and communication tools into a unified system. We’re looking for our first Senior DevOps Engineer to deliver rock-solid reliability and deployment at scale. </p><p dir=\"ltr\">As an early member of our small, high-impact team, your work will directly shape the future of our platform and deliver a product experience that delights our customers.</p><p><strong><br /></strong></p><h2 dir=\"ltr\">Responsibilities</h2><ul><li dir=\"ltr\"><p dir=\"ltr\">Design deployment strategy for the platform.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Own CI/CD pipelines and cloud infrastructure.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Manage PostgreSQL (Supabase) performance, migrations, and HA.<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Implement observability for the platform and workflows (logs, metrics, tracing).<br /><br /></p></li><li dir=\"ltr\"><p dir=\"ltr\">Ensure security, scalability, and cost efficiency.<br /><br /></p></li></ul><h2 dir=\"ltr\">Technical Requirements</h2><ul><li dir=\"ltr\"><p dir=\"ltr\">5+ years in DevOps/SRE roles</p></li><li dir=\"ltr\"><p dir=\"ltr\">3+ years of experience in one of the cloud platforms (AWS, Azure)</p></li><li dir=\"ltr\"><p dir=\"ltr\">Strong with Docker, Kubernetes, CI/CD.</p></li><li dir=\"ltr\"><p dir=\"ltr\">Solid PostgreSQL administration skills.</p></li><li dir=\"ltr\"><p dir=\"ltr\">IaC (Terraform, Pulumi, or similar).</p></li></ul><p dir=\"ltr\">Nice to Have</p><ul><li dir=\"ltr\"><p dir=\"ltr\">Experience with workflow automation/orchestration (Temporal, Airflow, n8n).</p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience with observability for LLMs</p></li></ul><h2 dir=\"ltr\">Core Competencies</h2><ul><li dir=\"ltr\"><p dir=\"ltr\"><strong>Critical Thinking &amp; Problem-Solving:</strong> The ability to analyse complex challenges, identify root causes, and develop effective, logical and scalable solutions.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Adaptability:</strong> The flexibility to thrive in a changing environment, adjust to new challenges, and learn new skills quickly.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Attention to Detail: </strong>A precise and thorough approach to your work, ensuring accuracy and quality in every task.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Communication &amp; Collaboration: </strong>The ability to clearly articulate ideas and work effectively with others to achieve shared goals.</p></li><li dir=\"ltr\"><p dir=\"ltr\"><strong>Autonomy &amp; Accountability: </strong>The discipline to take ownership of your work, manage tasks independently, and deliver results with minimal supervision.<br /><br /></p></li></ul><p dir=\"ltr\">Joining our team means that you'll be part of a small group of people who are genuinely excited about the product and momentum we're building. We value curiosity, collaboration and accountability. </p><p>Here, you’ll get to see your work progress from an idea to a finished product, fast.</p><p>This is a unique opportunity to make a real impact and grow alongside us. If this sounds like the kind of place you want to be, we'd love to hear from you.</p><p>Aguru is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all.</p><p>To apply, please send your CV to the attention of Oleg at <strong>hiring@aguru.com</strong> with the subject line \"Application for Senior DevOps Engineer\".  The deadline to apply is <strong>September 30, 2025</strong>.</p><p><br /></p><br/><br/>Please mention the word **STAUNCHNESS** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-devops-engineer-aguru-uk-1104952"
  },
  {
    "title": "Social Media Manager & Shitposter @ Fun Ecom Co",
    "company": "JLS Trading Co",
    "location": "",
    "description": "<p dir=\"ltr\">- Do you have trouble communicating through anything but memes?</p><p dir=\"ltr\">- Did you livestream your family staging an intervention for your social media addiction?</p><p dir=\"ltr\">- Do you thrive in a high-stress environment filled with political infighting, bureaucracy, and corporate nonsense?</p><p><strong><br /></strong></p><p dir=\"ltr\">If so, then we are the place for you, except you might hate how nice of a company we have - filled with happy, generally competent people that don’t put up with jerks. Frankly, it makes me sick how nice everyone is!</p><p><strong><br /></strong></p><p dir=\"ltr\">We are remote full time, have very flexible hours, people are judged by their output, not by how much they suck up to the boss, and turnover is super low because the company believes that happy employees = happy customers = happy bank account. Simply disgusting, if you ask me.</p><p><strong><br /></strong></p><p dir=\"ltr\">--Is this a real job ad?--</p><p dir=\"ltr\">Yup! Amazingly enough, we actually paid money to post this on a bunch of different job sites. And it’s not even a pyramid scheme! Plus, get this: the owner just started paying our 70ish employees with money instead of Pizza Hut coupons - we’re big time, people.</p><p><strong><br /></strong></p><p dir=\"ltr\">Our careers page is actually worth checking out to learn more about how insane we are (sidenote: it won a web design award in 1993 - we’re a pretty big deal):</p><p><strong><br /></strong></p><p dir=\"ltr\"><a href=\"http://www.jlstradingco.com/careers/\">http://www.jlstradingco.com/careers/</a></p><p><strong><br /></strong></p><p dir=\"ltr\">And check out our reviews on <a href=\"https://www.google.com/search?q=JLS+Trading+Co%20Charlotte,%20NC\">Google</a>, <a href=\"https://www.glassdoor.com/Overview/Working-at-JLS-Trading-EI_IE1949817.11,22.htm\">Glassdoor</a>, or <a href=\"https://www.indeed.com/cmp/Jls-Trading-Co\">Indeed</a> to see that it’s not just the founder’s mother who says we’re cool.</p><p><strong><br /></strong></p><p dir=\"ltr\">--What do you guys do?--</p><p dir=\"ltr\">We do a lot of different things these days including selling awesome consumer products (these are just a small sampling): </p><p><strong><br /></strong></p><p dir=\"ltr\">- Bad Parking Cards (<a href=\"https://amz.run/5Eya\">https://amz.run/5Eya</a>)</p><p dir=\"ltr\">- Beverage Barricades (<a href=\"https://amz.run/6kip\">https://amz.run/6kip</a>)</p><p dir=\"ltr\">- Child Chucker (<a href=\"https://amz.run/9EUz\">https://amz.run/9EUz</a>)</p><p><strong><br /></strong></p><p dir=\"ltr\">Running this Amazon Pay-Per-Click agency: PPCFarm.com (we’re really, really good at PPC)</p><p><strong><br /></strong></p><p dir=\"ltr\">And we will soon be launching a SaaS product for inventory management.</p><p><strong><br /></strong></p><p dir=\"ltr\">We are doing our best to grow rapidly every year, and it’s our intention to continue that for as long as possible, which means we need good people to help us keep up with the growth.</p><p><strong><br /></strong></p><p dir=\"ltr\">--What is your company like?--</p><p dir=\"ltr\">1. You Can Be Yourself. You don’t have to put on a fake, professional face. You can just be yourself. You can talk smack to the CEO (highly encouraged), and no one will think anything of it. You don't have to dress up, or use formal language, or pretend to be something you're not - you can just be you.</p><p><strong><br /></strong></p><p dir=\"ltr\">2. Major Opportunities for Career Growth. We are not trying to just be a small business. We plan to be doing $100 million annually in the next few years. We promote quickly once we identify talent. It doesn’t matter what your credentials are – it matters what you get done.</p><p><strong><br /></strong></p><p dir=\"ltr\">3. Full Time Remote/Flexible Hours. You will be working from home in your pajamas, on your schedule. And we don’t care if you work 10 hour days 4 days a week or 6 hours a day and catch up over the weekend. So long as you get a lot of work done, we’re happy campers.</p><p><strong><br /></strong></p><p dir=\"ltr\">4. Complete Work/Life Balance. If you’re routinely working more than 45ish hours, you’re gonna get a friendly talking-to. We want you to be operating at 100% capacity, which means that you need to rest.</p><p><strong><br /></strong></p><p dir=\"ltr\">5. Strongly Anti-BS. Anybody in the company can (and is expected to) tell the CEO when he is wrong. There are no bureaucratic or BS rules getting in the way of getting work done.</p><p><strong><br /></strong></p><p dir=\"ltr\">6. No Micro-Management. Once you’re trained and have demonstrated you know your stuff, we are pretty hands-off. In fact, if you need external management to stay on-task and motivated, we probably aren’t the place for you.</p><p><strong><br /></strong></p><p dir=\"ltr\">7. No Toxic/Incompetent People Allowed. We try very hard to screen out mean or stupid people before they get in, but in case they slip through, we fire them quickly. You will never have to interact with someone who is an obvious idiot or straight up malicious. No toxic or incompetent people at work - could it really be? [Yes]</p><p><strong><br /></strong></p><p dir=\"ltr\">8. Supportive Environment. We don’t operate via intense stress or unreasonable top-down deadlines. Everyone wants you to be successful – internal politics are at a minimum here.</p><p><strong><br /></strong></p><p dir=\"ltr\">9. Lots of Raises. We do our absolute best to get ahead of things and give raises preemptively, so you don't have to ask for one. It's not unusual at all for someone to receive 2+ raises per year.</p><p><strong><br /></strong></p><p dir=\"ltr\">10. We’ll Invest in Your Training. We want you and everyone to get better constantly. You’ll be learning new things all the time, and are strongly encouraged to invest time every day to learn new things, improve your system/work process, and just generally try to make your life easier.</p><p><strong><br /></strong></p><p dir=\"ltr\">11. 4-6+ Weeks Vacation. We 100% want you to recharge, so having plenty of time off is absolutely worth it.</p><p><strong><br /></strong></p><p dir=\"ltr\">12. Paid Maternity/Paternity Leave. We’ve even started letting people skip meetings during labor!</p><p><strong><br /></strong></p><p dir=\"ltr\">13. Self-Funded So We Can Do What’s Right for Us. We don’t have to answer to anyone but ourselves, so we can make the right decision for the long-term health of the company vs trying to get big too fast or cut corners to appease some selfish investor.</p><p><strong><br /></strong></p><p dir=\"ltr\">--What are your company’s values?--</p><p dir=\"ltr\">See here: <a href=\"http://www.jlstradingco.com/careers/\">http://www.jlstradingco.com/careers/</a></p><p><strong><br /></strong></p><p dir=\"ltr\">Yes, those are legitimately our values. The careers page is definitely worth checking out - it’s not just normal corporate BS. We promise you’ll learn a lot about us.</p><p><strong><br /></strong></p><p dir=\"ltr\">--OK, so I’ve read like 8 dang pages about you guys. Will you tell me what the actual job is?--</p><p dir=\"ltr\">No.</p><p><strong><br /></strong></p><p dir=\"ltr\">--Wait... What?--</p><p dir=\"ltr\">OK fiiine.</p><p><strong><br /></strong></p><p dir=\"ltr\">Helping to make our social media presence 1000x less shitty by being a reply guy, shitposting, responding to comments on our posts, and doing whatever else you can to create raving fans of our brands (<a href=\"https://www.wittyyeti.com/\">Witty Yeti</a> will be your primary project at the start).</p><p><strong><br /></strong></p><p dir=\"ltr\">We are very early in our social media exploration/development and what we are doing now isn’t enough. We want to absolutely crush, and need your knowledge and sense of humor to help get there.</p><p><strong><br /></strong></p><p dir=\"ltr\">You’re gonna be tasked with pulling all the levers you reasonably can to grow our social media - we’re not expecting you to make videos yourself (unless you want to), but want you to shitpost and comment and help with creative ideation (let’s hop on this trend real quick, this meme would be hilarious, etc).</p><p><strong><br /></strong></p><p dir=\"ltr\">You’re basically gonna be a social media generalist - doing whatever is necessary (within reason, of course) to help us be successful in reaching The People™. Maybe it’s updating our page, maybe it’s making some thumbnails (we can teach you), maybe it’s responding with the perfect GIF, maybe it’s crafting new copy pasta for someone who tweeted the most ridiculous thing you’ve ever heard.</p><p><strong><br /></strong></p><p dir=\"ltr\">We’ll see how it shakes out and very much want to set you up for success, and the right strategy will require your input before we set anything in stone. We’ll likely just feel our way through trying to find the thing(s) that work.</p><p><strong><br /></strong></p><p dir=\"ltr\">Like everyone else in the company, you will also need to innovate regularly - which means figuring out ways to improve quality and production speed.</p><p><strong><br /></strong></p><p dir=\"ltr\">--Do I need experience?--</p><p dir=\"ltr\">We expect you to have a minimum of 70 years of experience (120+ preferred).</p><p><strong><br /></strong></p><p dir=\"ltr\">Oh, you haven't lived two lifetimes eating and breathing business 24/7/365? Who TF do you think you are, reading this job description? You absolute buffoon.</p><p><strong><br /></strong></p><p dir=\"ltr\">Oh, you haven't been directly involved in at least two (preferably three) World Wars? You're not even qualified to operate our coffee machine, you sentient potato.</p><p><strong><br /></strong></p><p dir=\"ltr\">Oh, you didn't observe the Big Bang as it happened? Get out of here, you pirated copy of Windows 95.</p><p><strong><br /></strong></p><p dir=\"ltr\">I might throw up from your arrogance. The hubris to think that you, an absolute fool, could apply for a social media job... sickening. I’m literally shaking right now.</p><p><strong><br /></strong></p><p dir=\"ltr\">Also, no you don't need any experience.</p><p><strong><br /></strong></p><p dir=\"ltr\">We want special people, and don’t give AF what their background is. Most of our best people did nothing remotely related to their current roles, so if you've never done anything like this before, don't sweat it. We hire 100x more for potential than existing knowledge.</p><p><strong><br /></strong></p><p dir=\"ltr\">The Big Bang requirement still stands though.</p><p><strong><br /></strong></p><p dir=\"ltr\">--Do I need a college degree?--</p><p dir=\"ltr\">You just need to be awesome.</p><p><strong><br /></strong></p><p dir=\"ltr\">--Are there any geographic restrictions?--</p><p dir=\"ltr\">As long as you are in a country that doesn’t have active sanctions from the US government, we are interested. Our founder isn’t known for respecting the government much, but they have all the guns, so…</p><p><strong><br /></strong></p><p dir=\"ltr\">--What are your social media accounts?--</p><p dir=\"ltr\">This will give you an idea of what we’re currently doing:</p><p><strong><br /></strong></p><p dir=\"ltr\"><a href=\"https://www.tiktok.com/@wittyyeti.com\">https://www.tiktok.com/@wittyyeti.com</a></p><p dir=\"ltr\"><a href=\"https://www.instagram.com/witty.yeti/\">https://www.instagram.com/witty.yeti/</a></p><p><strong><br /></strong></p><p dir=\"ltr\">--I know a ton about social media but haven’t “run” it before--</p><p dir=\"ltr\">As long as you are willing to learn (from others because we have no clue what we’re doing), then you’ll be fine. We have lots of people in the company who never did their role before and we just paid them to learn, and now they do great.</p><p><strong><br /></strong></p><p dir=\"ltr\">--This sounds pretty good, though I’m still skeptical that this isn’t a pyramid scheme.--</p><p dir=\"ltr\">You sound just like the tax authorities!</p><p><strong><br /></strong></p><p dir=\"ltr\">--That doesn’t resolve any of my fears, but what do I need to do to apply?--</p><p dir=\"ltr\">Please submit your information on the following page to apply. We promise to respond within 5-10 business days even if our answer is No.</p><p><strong><br /></strong></p><p dir=\"ltr\">There will be multiple steps in this process, FYI, including a long written application, interviews with potentially a few different people, and paid work test(s). Hiring the right people is really hard and very expensive if we do it poorly, so we have to front-load the process. I'm sorry about that and thank you for sticking with us.</p><p><strong><br /></strong></p><p dir=\"ltr\">Once you’re in our pipeline though, I would anticipate giving you a final answer within a few weeks, depending on how it goes. We definitely don’t want to string you along, and as long as you do what we ask, we promise to tell you “yes” or “no”, and to not just ghost you (like everybody I match with on Tinder).</p><p><strong><br /></strong></p><p dir=\"ltr\">Thank you for your time and interest, and I hope we can work together soon!</p><br/><br/>Please mention the word **ADVOCATES** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-social-media-manager-shitposter-fun-ecom-co-jls-trading-co-1104790"
  },
  {
    "title": "Mid level Backend Dev for SaaS the music industry",
    "company": "MelodyIQ",
    "location": "",
    "description": "<p>We’re hiring a freelance mid-level backend developer to join our 100% remote, talented, energetic small team.</p><p>At MelodyIQ, we build music analytics tools trusted by the world’s top record labels — Sony, Universal, Def Jam, Island Records, and more.</p><p>The code you ship will directly shape how global campaigns are run for the world’s biggest artists like Billie Eilish, Kendrick Lamar and Calvin Harris.</p><h3>Role description</h3><p>You’ll start with daily maintenance and support tickets, then grow into deeper backend ownership — improving performance, fixing bugs, and building new features that matter.</p><p>You’re reliable, detail-focused, and proactive: someone who can keep the lights on while making the system better every week.</p><p><strong>Commitment:</strong> Minimum 4 hours per day, but ideally 6-8 hours per day.</p><p><strong>Contract:</strong> Will start as month-to-month freelance, with the option to move to long-term hire if it’s a great fit.</p><p><strong>Timezone:</strong> We’re prioritising candidates located between Europe and Australia, with at least 4 hours of daily overlap with Central European Time (ideal: Eastern Europe).</p><h3>What You’ll Do</h3><ul><li>Handle daily system maintenance and customer support tickets</li><li>Debug and fix bugs in production with care and precision</li><li>Improve reliability and performance of our backend systems</li><li>Refactor existing Javascript code into TypeScript and clean up legacy code</li><li>Build internal automations and tools to make life easier for the team</li><li>Write and maintain tests that keep our systems fast and dependable</li><li>Take part in database migrations, CI improvements, and dependency upgrades</li><li>Monitor dashboards and proactively flag potential issues</li><li>Ship pragmatic solutions, not over-engineered ones</li></ul><h3>Example Tasks You Might Work On</h3><ul><li>Upgrading our PostgreSQL instance</li><li>Optimizing PostgreSQL queries</li><li>Refactoring backend code from Javascript into TypeScript</li><li>Setting up Grafana dashboards to monitor key metrics</li><li>Reducing GCP costs through smarter infrastructure decisions</li><li>Migrating GCP Gen1 to Gen2 cloud functions</li><li>Improving CI/CD deployment processes</li><li>Cleaning up old/unused database tables</li></ul><h3>Who We’re Looking For</h3><ul><li>4+ years of experience as a backend or full stack engineer</li><li>Strong written communicator (we’re async and remote-first)</li><li>Comfortable working autonomously day to day</li><li>Trustworthy, conscientious, and detail-oriented</li><li>Pragmatic: proud of your code but focused on simplicity and maintainability</li><li>Curious and eager to learn, especially in a fast-moving SaaS startup</li><li>Previous experience in fully remote async teams is a plus</li></ul><h3>Required technical skills</h3><ul><li><strong>Very experienced at large PostgreSQL databases in a work setting</strong></li><li>Node</li><li>Typescript / javascript</li><li>At least basic React</li></ul><h3>Nice to have technical skills</h3><ul><li>Google cloud</li><li>Experienced at React</li><li>Redis</li><li>Github actions</li><li>Grafana/Prometheus</li></ul><p><br /></p><p><br /></p><br/><br/>Please mention the word **EXCELLENCY** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-mid-level-backend-dev-for-saas-the-music-industry-melodyiq-1103192"
  },
  {
    "title": "Online Data Research with Bonus",
    "company": "TELUS Digital",
    "location": "",
    "description": "<div class=\"figma-padding-bottom-32 tw-border-b tw-border-[#E3E6E8]\"><p class=\"sui-text-b3 sui-text-darkGray-darker ql-editor\"><br /></p><p>Looking for a freelance opportunity where you can make an impact on technology from the comfort of your home? If you are dynamic, tech-savvy, and always online to learn more, this part-time flexible project is the perfect fit for you! </p><p><br /></p><p><strong>A Day in the Life of a Personalized Internet Assessor:</strong></p><ul><li>In this role, you’ll be analyzing and providing feedback on texts, pages, images, and other types of information for top search engines, using an online tool</li><li>Through reviewing and rating search results for relevance and quality, you’ll be helping to improve the overall user experience for millions of search engine users, including yourself.</li></ul><p><br /></p><p>Join our team today and start putting your skills to work for one of the world's leading search engines.</p><p><br /></p><p>The estimated hourly earnings for this role are 14 USD per hour. </p><p><br /></p><p><strong>TELUS Digital AI Community</strong></p><p>Our global AI Community is a vibrant network of 1 million+ contributors from diverse backgrounds who help our customers collect, enhance, train, translate, and localize content to build better AI models. Become part of our growing community and make an impact supporting the machine learning models of some of the world’s largest brands.</p><p><br /></p></div><div class=\"pt-7\"><h4 class=\"sui-font-heading sui-text-h2 tw-font-bold sui-text-darkGray-darker tw-mb-1\">Qualification path</h4><p class=\"sui-text-b3 sui-text-darkGray-darker ql-editor\"><br /></p><p>No previous professional experience is required to apply to this role, however, working on this project will require you to pass the basic requirements and go through a standard assessment process. This is a part-time long-term project and your work will be subject to our standard quality assurance checks during the term of this agreement. </p><p><br /></p><p><strong>Basic Requirements</strong></p><ul><li>Working as a freelancer with excellent communication skills in English</li><li>Being a resident in the United States for the last 3 consecutive years and having familiarity with current and historical business, media, sport, news, social media, and cultural affairs in the US.</li><li>Active use of Gmail and other forms of social media and experience in the use of web browsers to navigate and interact with a variety of content</li><li>Daily access to a broadband internet connection, a smartphone (Android 5.0, iOS 14 or higher), and a personal computer to work on.</li></ul><p><br /></p><p><strong>Assessment</strong></p><p>In order to be hired into the program, you’ll take a language assessment and an open book qualification exam that will determine your suitability for the position and complete ID verification. Don’t worry, our team will provide you with guidelines and learning materials before your exam. You will be required to complete the exam in a specific timeframe but at your convenience!</p><p><br /></p></div><br/><br/>Please mention the word **ADVANCED** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-online-data-research-with-bonus-telus-digital-1101930"
  },
  {
    "title": "Engineering Lead",
    "company": "Aragon",
    "location": "Remote",
    "description": "<p><span style=\"font-size: 16px;\">Aragon is a small team of people that spans a broad range of backgrounds, interests, and geographies. We're entrepreneurs and degens, technologists and skeptics, troublemakers and problem solvers, who are building unstoppable tooling for the next generation of onchain organizations.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Aragon launched the first DAO framework in 2017, securing over $35 billion in assets for the likes of Lido and Curve. We are currently building Aragon OSx, a toolkit for launching secure and modular organizations, and which is used by projects such as Polygon and Taiko.</span></p><p><br></p><p>As a cross‑functional engineering lead on Aragon’s Platform Team, you’ll code and coordinate across frontend, backend, and our Aragon OSx smart contract frameworking, owning some of our most challenging features, architecture cohesion, operational discipline, and platform reliability so our onchain products ship fast and safely.</p><p><br></p><p>For more info about what we’re up to, check out our latest blog, <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://blog.aragon.org/the-next-generation-of-onchain-organizations/\">The Next Generation of Onchain Organizations</a>.</p>\\n<p></p><p><br></p><b>💪 What you’ll do</b><ul><li>Own the coordination ceremonies and touch points across frontend, backend, smart contracts, and SRE/DevOps so engineering stays technically aligned and the efforts grounded in actual product requirements.</li><li>Provide guidance on architecture across the stack by aligning interfaces across components and making sure they fit together cleanly, while being mindful of dependencies and how design choices affect future flexibility.</li><li>Define and prioritize technical work by balancing roadmap features against refactors and other engineering needs, and collaborate with Product on acceptance criteria so priorities reflect both strategic goals and practical trade-offs.</li><li>Promote E2E production health by driving cultural practices and principles - for tests, release discipline, monitoring, and incident response - that make quality and security a default.</li><li>Strengthen the team by mentoring engineers at every level and documenting critical knowledge and reference material so the team is always growing and without being dependent on any single person.</li><li>Code! Even in a leadership role, the best way to understand and improve the stack is by working with it and writing code - frontend, backend, or contracts - reviewing peers’ work, and getting your hands dirty to help ship features!</li></ul><p><br></p><b>⚠️ Minimum requirement</b><ul><li>Proven ability to oversee production systems where you owned their quality, from defining done, enforcing tests, managing regressions, and taking responsibility for release reliability</li><li>Senior-level depth in either frontend (JS/TS and a modern framework, ideally React) <b>or</b> backend (Node/TS or similar) or ****both</li><li>CI/CD literacy (e.g., GitHub Actions, CircleCI) and practical understanding of monitoring/alerts and incident handling</li><li>Experience working on open source projects, ideally in blockchain, cryptography, smart contracts, decentralized systems, or any related technology in the web3 ecosystem</li><li>Experience as an engineering manager, tech lead, or similar technical leadership role, ideally for a remote team</li><li>Experience working in agile environment, git flows, and are comfortable in the tools (e.g. Jira, Github)</li><li>Passionate and an active user of web3 applications</li><li>Excellent English communication - both written and oral</li></ul><p><br></p><b>💡 Bonus skills</b><ul><li>Ethereum/EVM mastery</li><li>Experience building or working with blockchain indexers.</li><li>Experience acting as Scrum Master</li><li>Experience building monitoring systems yourself</li><li>Experience working on a project with a module or plugin system</li><li>Passionate about the possibilities of decentralized autonomous organizations and the impacts they may have on how humans work together to solve problems</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 16px;\">We value freedom and responsibility among our contributors. In practice, this means that we're a remote distributed organization that's flexible as to where you want to work and your schedule. We will trust you to accommodate and support your team, and communicate if you ever feel stretched thin. You will get all of the resources needed to be effective, whether its for setting up your remote work environment or a personal development budget.</span></p><p><br></p><p><span style=\"font-size: 16px;\">This role reports to Aragon X, a Swiss AG dedicated to advancing the Aragon Project. We are an Equal Opportunity Employer supporting a community of DAO builders, developers, and users experimenting with new forms of social coordination and governance.</span></p><br/><br/>Please mention the word **JOY** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-engineering-lead-aragon-1097929"
  },
  {
    "title": "Python Developer",
    "company": "Ampcontrol",
    "location": "",
    "description": "<h2>🚀About <a href=\"https://www.ampcontrol.io/\">Ampcontrol</a></h2><p>Ampcontrol is building AI-powered software for optimizing electric vehicle (EV) fleet charging.</p><p>We are a venture backed hybrid team of engineers and energy experts based in Europe, the U.S.A., Canada and South America, building the new way of EV charging. Our primary goal is to enable a simple, reliable &amp; cost efficient transition to zero emission vehicles for fleet operators.</p><p>Our company culture includes minimal hierarchy; We make technical decisions based on consensus and aim at simplicity and clarity.</p><p>(<a href=\"https://www.ampcontrol.io/\">link to website</a>)</p><h2>🌎 Our Mission</h2><p>We're on a mission to speed up the transition of the automotive and logistic industries to electric fleets and vehicles.</p><p>We believe in a future of self-managing, reliable and affordable charging for companies, fleet operators and humans on our planet.</p><h2>💻 The Role</h2><p>You will be:</p><ul><li>Building, improving and operating our Python backend, including RabbitMQ, PostgreSQL, TimescaleDB, Redis, asynchronous services and customer facing APIs with FastAPI</li><li>Collaborating with our DevOps team to improve and extend our GCP deployment and observability stack</li><li>Maintaining and improving our extensive test suite, including end-to-end-, BDD-, integration- and unit tests</li><li>Learning in-depth the EV charging domain, relevant specifications, standards and integrations</li><li>Working with our data science team to build real-time optimization and AI solutions</li><li>Investigating, troubleshooting complex backend issues, make performance improvements and mitigate scalability challenges</li><li>Building, maintaining and migrating databases and accommodate time-series data</li><li>Onboard to our innovative edge server project, learning about ModBus, MQTT and secure websocket protocols</li></ul><h2>⭐ About you</h2><ul><li>You can apply at all levels, but you have at least 2 years of full-time work experience with a software stack similar to ours.</li><li>You can elaborate on why you love Python, its ecosystem and components present in our tech stack</li><li>You are confident in your Python coding skills to produce clean, well-tested and idiomatic code and learn fast on the job when necessary</li><li>You have hands-on experience with at least one cloud computing platform</li><li>You have a good understanding of DevOps tools and methods</li><li>You can communicate in English with clarity about complex technical topics</li><li>You are motivated to work in the EV and sustainability domain</li><li>You understand the differences between types of databases and you are comfortable with at least SQL schema design, indexes and migrations</li><li>You appreciate our flat hierarchy, collaborative work environment and understand why we prioritize helping each other first</li></ul><h2>📍 Location</h2><p><strong>We're a hybrid team.</strong> You can work from Europe, the United States, Canada, or South America, with in-office options in New York, and Erlangen, Germany.</p><h2>💎 Compensation</h2><ol><li>Internationally competitive salary</li><li>Equity incentive plans</li><li>Parental leave and 20 days PTO</li><li>Healthcare and dental plans</li><li>Global offsites</li><li>Personal growth plan and mentoring</li></ol><p>Please note: We’re flexible in how we work together. This role can be set up as a contract position, or you can be hired through our Employer of Record (EOR) partner, or directly through our US entity, depending on your location and preference.</p><h2>🛂 Visa support</h2><p>We are not able to support visa applications at this time.</p><p><br /></p><br/><br/>Please mention the word **COMPLIMENTARY** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-python-developer-ampcontrol-1096950"
  },
  {
    "title": "Senior Editor",
    "company": "AFAR",
    "location": "New York, NY",
    "description": "<p><span style=\"font-size: 11pt;\">Afar is looking for a senior editor to join its digital editorial team.&nbsp;&nbsp;</span></p><p><span style=\"font-size: 11pt;\">The senior editor will be responsible for top editing a variety of text-based digital travel content, from inspiration stories to intel, from longreads to quick hits. They will work in a fast-paced and collaborative environment, coordinating with other editors and reporting to the editorial director.&nbsp;</span></p><p><br></p><p><b style=\"font-size: 11pt;\">Work location:</b><span style=\"font-size: 11pt;\">Our company is fully remote, but this role must be based in New York.&nbsp;</span></p><p><br></p><p><b style=\"font-size: 11pt;\">Essential Functions</b></p><p><span style=\"font-size: 11pt;\">Line editing and top editing several stories a day</span></p><p><span style=\"font-size: 11pt;\">Headline and display writing</span></p><p><span style=\"font-size: 11pt;\">Story packaging</span></p><p><span style=\"font-size: 11pt;\">Idea development</span></p><p><span style=\"font-size: 11pt;\">Assigning articles</span></p><p><span style=\"font-size: 11pt;\">Cultivating relationships with freelance writers from a diverse range of backgrounds and identities</span></p><p><span style=\"font-size: 11pt;\">Writing and updating articles</span></p><p><span style=\"font-size: 11pt;\">Organizing and developing content calendars</span></p><p><span style=\"font-size: 11pt;\">Attending industry events and meetings</span></p><p><br></p><p><span style=\"font-size: 11pt;\">Note: This role does not guarantee travel</span></p><p><br></p><p><b style=\"font-size: 11pt;\">Requirements</b></p><p><span style=\"font-size: 11pt;\">Minimum 5 years hands-on text editing experience</span></p><p><span style=\"font-size: 11pt;\">5-7 years working in a deadline-driven, journalism environment</span></p><p><span style=\"font-size: 11pt;\">Sharp line editing, story shaping, and packaging skills</span></p><p><span style=\"font-size: 11pt;\">Reporting experience and knowledge of fact-checking best practices</span></p><p><span style=\"font-size: 11pt;\">Meticulous attention to detail and grammar</span></p><p><span style=\"font-size: 11pt;\">Ability to manage multiple deadlines simultaneously</span></p><p><span style=\"font-size: 11pt;\">Ability to write clear, engaging copy and help others to do the same</span></p><p><span style=\"font-size: 11pt;\">Agility in storytelling skills, jumping from a longform feature to a short news item to a roundup to a destination spotlight</span></p><p><span style=\"font-size: 11pt;\">Excellent communication skills and ability to cooperate effectively with staff and freelancers in a remote work environment</span></p><p><span style=\"font-size: 11pt;\">Experience assigning and commissioning articles</span></p><p><span style=\"font-size: 11pt;\">Experience working in a CMSExperience writing newsletters</span></p><p><span style=\"font-size: 11pt;\">Experience scriptwriting and capturing footage for social video&nbsp;</span></p><p><span style=\"font-size: 11pt;\">Must have a passion for travel, and be interested in conceptualizing new and interesting ways to create travel storytelling</span></p><p><br></p><p><span style=\"font-size: 11pt;\">You are:</span></p><p><span style=\"font-size: 11pt;\">A strategic and creative thinker</span></p><p><span style=\"font-size: 11pt;\">Capable of bringing out the best in both writers and editors</span></p><p><span style=\"font-size: 11pt;\">A proactive self-starter with a collaborative spirit</span></p><p><span style=\"font-size: 11pt;\">A team player who finds satisfaction in both contributing ideas and doing the work to make them happen</span></p>\\n<p></p><p><br></p><p></p>\\n<div>$90,000 - $95,000 a year</div>\\n<br/><br/>Please mention the word **LYRICAL** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-editor-afar-1096931"
  },
  {
    "title": "Freelance Python Contributor Project Aurora",
    "company": "Datacurve",
    "location": "",
    "description": "<h2>🚀 About Us</h2><p><strong>Shipd.ai by <a href=\"https://datacurve.ai/\">Datacurve</a> (YC W24)</strong> is creating the worlds leading frontier coding data to power the top AI models today. We work with the <strong>leading AI labs in the world</strong> to teach their models how the best developers code.</p><p>In the last few month, we’ve <strong>paid out over $700,000 USD</strong> to a global community of developers, students, and industry professionals who have helped us push the boundaries of what leading coding LLMs can do.</p><hr /><h2>🧑‍💻 The Role</h2><p>We’re looking for developers to <strong>create real-world Python coding challenges</strong> for <strong>Project Aurora</strong>, our latest initiative designed to advance a top coding LLM's ability to debug code. </p><p>These tasks should feel like <strong>genuine engineering work</strong>, with the kinds of <strong>problem solving, edge cases, and complexity</strong> developers encounter every day.</p><p>By contributing, you’ll be directly enhancing the<strong> next generation of AI system's ability to understand and generate code</strong>, making them more useful for software teams everywhere.</p><hr /><h2>💰 What You’ll Get</h2><ul><li><p><strong>$80 – $100 USD per accepted challenge</strong> <em>(with additional bonuses for high-volume or standout work)</em></p></li><li><p><strong>Full flexibility</strong> → pick up however many tasks, wherever and whenever you want</p></li><li><p><strong>A chance to shape the frontier of AI + coding</strong>, and have your work directly impact the next generation of coding models</p></li></ul><hr /><p>👉 <strong>Join us if you’re ready to use your Python expertise to help shape the future of coding and AI!</strong></p><br/><br/>Please mention the word **ADORABLE** and tag RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm when applying to show you read the job post completely (#RMjQwOTo0MGMyOjEyM2U6ZGM1NzpkMTliOjk5N2M6OGVjNDoxYzJm). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "source": "RemoteOK API",
    "url": "https://remoteOK.com/remote-jobs/remote-freelance-python-contributor-project-aurora-datacurve-1096434"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Google",
    "location": "Mountain View, CA",
    "description": "Design, develop, test, deploy, maintain and improve software. Manage individual project priorities, deadlines and deliverables. Write clean, efficient, and well-documented code. Collaborate with cross-functional teams to define and ship new features.",
    "source": "Public Dataset",
    "url": "https://careers.google.com"
  },
  {
    "title": "Frontend Developer",
    "company": "Facebook",
    "location": "Menlo Park, CA",
    "description": "Build scalable web applications using React.js. Implement responsive designs and ensure cross-browser compatibility. Collaborate with UX designers and backend engineers. Optimize web performance and accessibility.",
    "source": "Public Dataset",
    "url": "https://facebook.com/careers"
  },
  {
    "title": "Backend Engineer",
    "company": "Amazon",
    "location": "Seattle, WA",
    "description": "Develop scalable distributed systems using AWS technologies. Design and implement RESTful APIs. Work with databases and caching systems. Ensure high availability and performance of services.",
    "source": "Public Dataset",
    "url": "https://amazon.jobs"
  },
  {
    "title": "Full Stack Developer",
    "company": "Netflix",
    "location": "Los Gatos, CA",
    "description": "Develop end-to-end features for streaming platform. Work with React frontend and Java/Spring backend. Implement microservices architecture. Participate in code reviews and architectural discussions.",
    "source": "Public Dataset",
    "url": "https://jobs.netflix.com"
  },
  {
    "title": "DevOps Engineer",
    "company": "Microsoft",
    "location": "Redmond, WA",
    "description": "Implement CI/CD pipelines using Azure DevOps. Manage cloud infrastructure on Azure. Automate deployment and monitoring processes. Ensure system reliability and scalability.",
    "source": "Public Dataset",
    "url": "https://careers.microsoft.com"
  },
  {
    "title": "Machine Learning Engineer",
    "company": "Apple",
    "location": "Cupertino, CA",
    "description": "Develop machine learning models for product features. Work with large datasets and implement data pipelines. Collaborate with research scientists and product teams. Deploy models to production environments.",
    "source": "Public Dataset",
    "url": "https://apple.com/careers"
  },
  {
    "title": "Data Engineer",
    "company": "Twitter",
    "location": "San Francisco, CA",
    "description": "Build and maintain data pipelines for analytics. Work with big data technologies like Hadoop and Spark. Design data models and ensure data quality. Support data scientists and analysts.",
    "source": "Public Dataset",
    "url": "https://careers.twitter.com"
  },
  {
    "title": "Mobile Developer",
    "company": "Uber",
    "location": "San Francisco, CA",
    "description": "Develop native mobile applications for iOS and Android. Implement user interfaces and business logic. Work with cross-platform technologies when appropriate. Ensure app performance and quality.",
    "source": "Public Dataset",
    "url": "https://uber.com/careers"
  },
  {
    "title": "Cloud Engineer",
    "company": "Salesforce",
    "location": "San Francisco, CA",
    "description": "Design and implement cloud infrastructure on AWS/Azure. Automate deployment and scaling processes. Ensure security and compliance of cloud environments. Monitor system performance and costs.",
    "source": "Public Dataset",
    "url": "https://salesforce.com/careers"
  },
  {
    "title": "QA Automation Engineer",
    "company": "Adobe",
    "location": "San Jose, CA",
    "description": "Develop automated test frameworks and scripts. Create and execute test plans for software products. Collaborate with developers to ensure quality. Implement continuous testing in CI/CD pipelines.",
    "source": "Public Dataset",
    "url": "https://adobe.com/careers"
  },
  {
    "title": "Mid-Level DevOps Developer",
    "company": "Amazon",
    "location": "Remote",
    "description": "Amazon is hiring a Mid-Level DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 8+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://amazon.com/careers/1000"
  },
  {
    "title": "Senior Full Stack Developer",
    "company": "Slack",
    "location": "San Francisco, CA",
    "description": "Slack is hiring a Senior Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Flask, Redis, Docker\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 7+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://slack.com/careers/1001"
  },
  {
    "title": "Mid-Level Backend Developer",
    "company": "Meta",
    "location": "Austin, TX",
    "description": "Meta is hiring a Mid-Level Backend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 4+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://meta.com/careers/1002"
  },
  {
    "title": "Senior Frontend Developer",
    "company": "Intel",
    "location": "Austin, TX",
    "description": "Intel is hiring a Senior Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using JavaScript, React, Node.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 3+ years of software development experience\n        - Proficiency in JavaScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://intel.com/careers/1003"
  },
  {
    "title": "Senior Frontend Developer",
    "company": "Microsoft",
    "location": "Austin, TX",
    "description": "Microsoft is hiring a Senior Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Go, Kubernetes, gRPC, GCP\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 2+ years of software development experience\n        - Proficiency in Go and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://microsoft.com/careers/1004"
  },
  {
    "title": "Mid-Level DevOps Developer",
    "company": "Adobe",
    "location": "Austin, TX",
    "description": "Adobe is hiring a Mid-Level DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 4+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://adobe.com/careers/1005"
  },
  {
    "title": "Junior Full Stack Developer",
    "company": "Salesforce",
    "location": "Austin, TX",
    "description": "Salesforce is hiring a Junior Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using JavaScript, React, Node.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 3+ years of software development experience\n        - Proficiency in JavaScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://salesforce.com/careers/1006"
  },
  {
    "title": "Junior DevOps Developer",
    "company": "Twitter",
    "location": "Austin, TX",
    "description": "Twitter is hiring a Junior DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using C#, .NET, SQL Server, Azure\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 6+ years of software development experience\n        - Proficiency in C# and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://twitter.com/careers/1007"
  },
  {
    "title": "Mid-Level DevOps Developer",
    "company": "IBM",
    "location": "Seattle, WA",
    "description": "IBM is hiring a Mid-Level DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Go, Kubernetes, gRPC, GCP\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 2+ years of software development experience\n        - Proficiency in Go and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://ibm.com/careers/1008"
  },
  {
    "title": "Mid-Level DevOps Developer",
    "company": "IBM",
    "location": "Austin, TX",
    "description": "IBM is hiring a Mid-Level DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 1+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://ibm.com/careers/1009"
  },
  {
    "title": "Mid-Level DevOps Developer",
    "company": "Airbnb",
    "location": "New York, NY",
    "description": "Airbnb is hiring a Mid-Level DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Flask, Redis, Docker\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 3+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://airbnb.com/careers/1010"
  },
  {
    "title": "Mid-Level Frontend Developer",
    "company": "Uber",
    "location": "Seattle, WA",
    "description": "Uber is hiring a Mid-Level Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Django, PostgreSQL, AWS\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 7+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://uber.com/careers/1011"
  },
  {
    "title": "Junior Backend Developer",
    "company": "Salesforce",
    "location": "San Francisco, CA",
    "description": "Salesforce is hiring a Junior Backend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 8+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://salesforce.com/careers/1012"
  },
  {
    "title": "Junior DevOps Developer",
    "company": "Oracle",
    "location": "Seattle, WA",
    "description": "Oracle is hiring a Junior DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Ruby, Rails, PostgreSQL, Heroku\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 1+ years of software development experience\n        - Proficiency in Ruby and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://oracle.com/careers/1013"
  },
  {
    "title": "Junior DevOps Developer",
    "company": "Netflix",
    "location": "New York, NY",
    "description": "Netflix is hiring a Junior DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 5+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://netflix.com/careers/1014"
  },
  {
    "title": "Junior Backend Developer",
    "company": "Cisco",
    "location": "Seattle, WA",
    "description": "Cisco is hiring a Junior Backend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 2+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://cisco.com/careers/1015"
  },
  {
    "title": "Junior Frontend Developer",
    "company": "Uber",
    "location": "Austin, TX",
    "description": "Uber is hiring a Junior Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Ruby, Rails, PostgreSQL, Heroku\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 5+ years of software development experience\n        - Proficiency in Ruby and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://uber.com/careers/1016"
  },
  {
    "title": "Senior Full Stack Developer",
    "company": "Spotify",
    "location": "New York, NY",
    "description": "Spotify is hiring a Senior Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Ruby, Rails, PostgreSQL, Heroku\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 7+ years of software development experience\n        - Proficiency in Ruby and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://spotify.com/careers/1017"
  },
  {
    "title": "Senior Frontend Developer",
    "company": "Uber",
    "location": "Remote",
    "description": "Uber is hiring a Senior Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using C#, .NET, SQL Server, Azure\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 4+ years of software development experience\n        - Proficiency in C# and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://uber.com/careers/1018"
  },
  {
    "title": "Mid-Level Frontend Developer",
    "company": "Spotify",
    "location": "New York, NY",
    "description": "Spotify is hiring a Mid-Level Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Django, PostgreSQL, AWS\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 8+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://spotify.com/careers/1019"
  },
  {
    "title": "Mid-Level DevOps Developer",
    "company": "Adobe",
    "location": "Seattle, WA",
    "description": "Adobe is hiring a Mid-Level DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using TypeScript, Angular, Express.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 2+ years of software development experience\n        - Proficiency in TypeScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://adobe.com/careers/1020"
  },
  {
    "title": "Junior Full Stack Developer",
    "company": "Airbnb",
    "location": "San Francisco, CA",
    "description": "Airbnb is hiring a Junior Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Ruby, Rails, PostgreSQL, Heroku\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 5+ years of software development experience\n        - Proficiency in Ruby and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://airbnb.com/careers/1021"
  },
  {
    "title": "Junior DevOps Developer",
    "company": "Oracle",
    "location": "New York, NY",
    "description": "Oracle is hiring a Junior DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Java, Spring Boot, MySQL, Azure\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 1+ years of software development experience\n        - Proficiency in Java and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://oracle.com/careers/1022"
  },
  {
    "title": "Junior Frontend Developer",
    "company": "Twitter",
    "location": "Austin, TX",
    "description": "Twitter is hiring a Junior Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Flask, Redis, Docker\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 8+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://twitter.com/careers/1023"
  },
  {
    "title": "Junior Full Stack Developer",
    "company": "Uber",
    "location": "Remote",
    "description": "Uber is hiring a Junior Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Go, Kubernetes, gRPC, GCP\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 5+ years of software development experience\n        - Proficiency in Go and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://uber.com/careers/1024"
  },
  {
    "title": "Junior Frontend Developer",
    "company": "Meta",
    "location": "Seattle, WA",
    "description": "Meta is hiring a Junior Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Django, PostgreSQL, AWS\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 8+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://meta.com/careers/1025"
  },
  {
    "title": "Senior DevOps Developer",
    "company": "Twitter",
    "location": "Austin, TX",
    "description": "Twitter is hiring a Senior DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Flask, Redis, Docker\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 8+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://twitter.com/careers/1026"
  },
  {
    "title": "Junior Full Stack Developer",
    "company": "Twitter",
    "location": "San Francisco, CA",
    "description": "Twitter is hiring a Junior Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Flask, Redis, Docker\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 8+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://twitter.com/careers/1027"
  },
  {
    "title": "Mid-Level Frontend Developer",
    "company": "Slack",
    "location": "Remote",
    "description": "Slack is hiring a Mid-Level Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using JavaScript, React, Node.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 4+ years of software development experience\n        - Proficiency in JavaScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://slack.com/careers/1028"
  },
  {
    "title": "Senior Frontend Developer",
    "company": "Uber",
    "location": "Remote",
    "description": "Uber is hiring a Senior Frontend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Go, Kubernetes, gRPC, GCP\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 2+ years of software development experience\n        - Proficiency in Go and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://uber.com/careers/1029"
  },
  {
    "title": "Senior Full Stack Developer",
    "company": "IBM",
    "location": "San Francisco, CA",
    "description": "IBM is hiring a Senior Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Python, Flask, Redis, Docker\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 2+ years of software development experience\n        - Proficiency in Python and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://ibm.com/careers/1030"
  },
  {
    "title": "Mid-Level Full Stack Developer",
    "company": "Cisco",
    "location": "Seattle, WA",
    "description": "Cisco is hiring a Mid-Level Full Stack Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using C#, .NET, SQL Server, Azure\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 5+ years of software development experience\n        - Proficiency in C# and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://cisco.com/careers/1031"
  },
  {
    "title": "Junior Backend Developer",
    "company": "Oracle",
    "location": "Austin, TX",
    "description": "Oracle is hiring a Junior Backend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Ruby, Rails, PostgreSQL, Heroku\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 6+ years of software development experience\n        - Proficiency in Ruby and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://oracle.com/careers/1032"
  },
  {
    "title": "Senior Backend Developer",
    "company": "Uber",
    "location": "Remote",
    "description": "Uber is hiring a Senior Backend Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using Java, Spring Boot, MySQL, Azure\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 3+ years of software development experience\n        - Proficiency in Java and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://uber.com/careers/1033"
  },
  {
    "title": "Mid-Level DevOps Developer",
    "company": "Stripe",
    "location": "Austin, TX",
    "description": "Stripe is hiring a Mid-Level DevOps Developer to join our team.\n        \n        Responsibilities:\n        - Develop and maintain software applications using JavaScript, React, Node.js, MongoDB\n        - Collaborate with cross-functional teams to deliver high-quality products\n        - Write clean, efficient, and well-tested code\n        - Participate in code reviews and architectural discussions\n        - Stay current with emerging technologies and best practices\n        \n        Requirements:\n        - 7+ years of software development experience\n        - Proficiency in JavaScript and related technologies\n        - Experience with modern development practices and tools\n        - Strong problem-solving and communication skills\n        - Bachelor's degree in Computer Science or equivalent experience\n        \n        We offer competitive compensation, comprehensive benefits, and opportunities for growth.",
    "source": "Realistic Sample",
    "url": "https://stripe.com/careers/1034"
  }
]